moiify/M26-DTU/stm32f030x8/projects/stm32f10x_std/Source/FML/gprs/gprs_process.c
/**
**************************************************************************************************
* @file        gprs_process.c
* @author
* @version   v0.1.0
* @date        
* @brief
**************************************************************************************************
* @attention
*
**************************************************************************************************
*/
#include "gprs_process.h"
#include "gprs_commond.h"
#include "gprs_cache.h"
#include "bsp_gprs.h"
#include "gprs_task.h"
#include "user_task.h"
#include "self_def.h"
#include "system_info.h"
#include "stm32_bsp_conf.h"
#include "osal.h"
#include "clog.h"
#include "cshell.h"
#include "zsproto_package_process.h"
/**
* @addtogroup    XXX 
* @{  
*/

/**
* @addtogroup    gprs_process_Modules 
* @{  
*/

/**
* @defgroup      gprs_process_IO_Defines 
* @brief         
* @{  
*/

/**
* @}
*/

/**
* @defgroup      gprs_process_Macros_Defines 
* @brief         
* @{  
*/
     
#define GPRS_CMD_QISACK_NO_ACK_MAX   705

/* 常规命令重发次数 */
#define GPRS_ATCMD_RETRYCOUNT_MAX   5

/* CSQ命令查询次数 */
#define GPRS_ATCMD_CSQ_RETRYCOUNT_MAX       30

#define GPRS_ATCMD_CREG_RETRYCOUNT_MAX      30

#define GPRS_ATCMD_CGREG_RETRYCOUNT_MAX     30

#define GPRS_ATCMD_QIOPEN_RETRYCOUNT_MAX    30
/* 常规命令超时时间*/
#define GPRS_TIMEOUT_TICKS              1000 // ms
/* 查询发送超时时间 */
#define GPRS_CMD_QISEND_TICKS           5000 // ms
/* 查询sim卡超时时间 */
#define GPRS_CMD_CPIN_TIMEOUT_TIME      2000 // ms

/* 关闭GPRS场景超时时间 */
#define GPRS_CMD_QIDEACT_TIMEOUT_TIME   40000 // ms

/* 激活GPRS场景超时时间 */
#define GPRS_CMD_QIACT_TIMEOUT_TIME     60000 // ms 

/* 连接服务器超时时间 */
#define GPRS_CMD_QIOPEN_TIMEOUT_TIME    5000 // ms

/* GPRS 断电时间；当GPRS长时间无法联网时，先断电，然后重新上电 */
#define GPRS_POWEROFF_HOLD_TIME         4000 // ms

/* GPRS 上电延时时间；GPRS先上电，上电后延时若干ms再进行其他操作 */
#define GPRS_POWERON_DELAY_TIME         5000 // ms

/* 开机键保持时间 */
#define GPRS_POWERKEY_HOLD_TIME         4000 // ms

/* 连续网络异常时间，当超过这个时间，模块将尝试断电重启 */
#define GPRS_CONTINUE_EXCEPTION_TIME    600000 // ms


#define GPRS_SENT_NOACK_COUT_MAX        3
/**
* @}
*/

/**
* @defgroup      gprs_process_Constants_Defines 
* @brief         
* @{  
*/

/**
* @}
*/

/**
* @defgroup      gprs_process_Private_Types
* @brief         
* @{  
*/
typedef struct
{
    uint8_t  Socket_En;
    Socket_Connectway Conncet_way;
    uint8_t  Domain[20];
    uint8_t  IP_Address[16];
    uint32_t Server_port;
    uint8_t  Mux;
    uint8_t  LinkState;
}SocketSource_Info_t;

typedef struct
{
    uint8_t  Socket_En;
    Socket_Connectway Conncet_way;
    uint8_t  *Domain;
    uint8_t  *IP_Address;
    uint32_t Server_port;
    uint8_t  LinkState;
    uint8_t  Mux;
}CurSocket_Info_t;


typedef struct
{
    GPRSState_t state;                       // GPRS的状态
    uint8_t retry_count;                     // 重发次数，仅用于初始化命令，不包括socket相关命令
    uint8_t cur_socket_open_failed_count;                // 发送确认检查无确认次数
    SocketState_t socketline_state;
    uint8_t Gprs_Init_Status;
    uint32_t ticks;                          // 命令发送时间，用于超时判断
    uint32_t busyticks;                      // 命令发送时间，用于超时判断
    uint8_t rssi;                            // 信号强度
    uint8_t rssi_count;                      // 信号查询次数
    uint8_t scoket_count;                    // 目前Socket的数量
    CurSocket_Info_t cur_socket_info;        // 目前正在连接的socket信息
    SocketSource_Info_t Socket_Info_t[3];    // 服务器信息

    uint8_t moudle_status;                   // 模块开关机状态
    GprsExtraReq extra_request;
    uint8_t qisack_req;
    uint8_t CurQISACKSocketNumber;
    uint16_t noack_len;
}GPRS_CB_t;

typedef struct
{
    GPRSState_t State[10];
    uint8_t In;
    uint8_t Out;
    uint8_t Size;
    uint8_t Count;
}GPRSMsgQueue_t;
/**
* @}
*/



/**
* @defgroup      gprs_process_Private_Variables 
* @brief         
* @{  
*/

static GPRS_CB_t    s_GPRS_CB = 
{
    .state = GPRSState_PowerOn_Req,
    .retry_count = GPRS_ATCMD_RETRYCOUNT_MAX,
    .ticks = 0,
    .rssi = 0xFF,
    .rssi_count=0,
    .socketline_state=SocketState_Busy,
    .cur_socket_open_failed_count = 0,
    .scoket_count=0,
    .retry_count=0,
	.Socket_Info_t=
    {
        {   .Socket_En=0,.LinkState=GPRSLinkState_Lost,},
        {   .Socket_En=0,.LinkState=GPRSLinkState_Lost,},
        {   .Socket_En=0,.LinkState=GPRSLinkState_Lost,},
    },
    .moudle_status=1,
    .qisack_req=0,
    .CurQISACKSocketNumber=0,
//    .cur_sent_len = 0,
//    .prev_sent_len = 0,
//    .cur_noack_len = 0,
//    .prev_noack_len = 0,
};
static GPRSMsgQueue_t s_GPRSMsgQueue=
{
    .In = 0,
    .Out = 0,
    .Count = 0,
    .Size = sizeof(s_GPRSMsgQueue.State)/sizeof(s_GPRSMsgQueue.State[0]),
};
/**
* @}
*/
/**
* @defgroup      gprs_process_Public_Variables 
* @brief         
* @{  
*/

/**
* @}
*/

/**
* @defgroup      gprs_process_Private_FunctionPrototypes 
* @brief         
* @{  
*/
static void gprs_check_process(void);
static void gprs_idle_process(void);
static void gprs_add_state(GPRSState_t next_state);
static void gprs_update_state(void);
static void gprs_update_request(void);
static void gprs_update_socket(void);
static void gprs_msg_queue_clear(void);
static void gprs_socket_deinit(void);
static void gprs_attribute_deinit(void);
static uint16_t getnoackLen(void);
/**
* @}
*/

/**
* @defgroup      gprs_process_Functions 
* @brief         
* @{
*/
static void gprs_add_state(GPRSState_t next_state)//加消息队列
{
    if (s_GPRSMsgQueue.Count < s_GPRSMsgQueue.Size)
    {
        s_GPRSMsgQueue.State[s_GPRSMsgQueue.In++] = next_state;
        s_GPRSMsgQueue.In %= s_GPRSMsgQueue.Size;
        s_GPRSMsgQueue.Count++;
    }
}
static void gprs_update_state(void)  //取消息队列
{
    if(s_GPRSMsgQueue.Count>0)
    {
        s_GPRS_CB.state= s_GPRSMsgQueue.State[s_GPRSMsgQueue.Out++];
        s_GPRSMsgQueue.Out %= s_GPRSMsgQueue.Size;
        s_GPRSMsgQueue.Count--;
    }
}
static void gprs_update_request(void)    //空闲时更新事件 ：CSQ QISEND QIACK  阻塞式
{   
    if(g_Machine_TransmitBuf.Count>0&&s_GPRS_CB.extra_request==GPRS_None_Req)
    {    
        if(s_GPRS_CB.Socket_Info_t[g_Machine_TransmitBuf.Buf[g_Machine_TransmitBuf.Out].Mux].LinkState==GPRSLinkState_Establish)
        {
            s_GPRS_CB.extra_request=GPRS_SendData_Req;
        }
    }
    else if(s_GPRS_CB.qisack_req==1&&s_GPRS_CB.extra_request==GPRS_None_Req)
    {   
        s_GPRS_CB.extra_request=GPRS_QISACK_Req;
    }    
    else if(s_GPRS_CB.rssi_count>0&&s_GPRS_CB.extra_request==GPRS_None_Req)
    {
        s_GPRS_CB.extra_request=GPRS_CheckRssi_Req;
    }
    switch(s_GPRS_CB.extra_request)
    {
        case GPRS_None_Req:
        {   
            break;
        }
        case GPRS_SendData_Req:
        {   
            gprs_add_state(GPRSState_QISEND_Req);
            s_GPRS_CB.extra_request=GPRS_Busy_Req;
            break;
        }
        case GPRS_CheckRssi_Req:
        {
            gprs_add_state(GPRSState_CSQ_Req);
            s_GPRS_CB.extra_request=GPRS_Busy_Req;
            break;
        }
        case GPRS_QISACK_Req:
        {   
            gprs_add_state(GPRSState_QISACK_Req);
            s_GPRS_CB.extra_request=GPRS_Busy_Req;
            break;
        }
        case GPRS_Busy_Req:
        {
            break;
        }
        default:
            break;
    }
}
static void gprs_update_socket(void)  //更新目前socket信息
{	
    static uint8_t count=0;
    if(s_GPRS_CB.socketline_state==SocketState_Idle)
    {   
        if(count== s_GPRS_CB.scoket_count)
        {
            count=0;
        }
        if(s_GPRS_CB.Socket_Info_t[count].Socket_En==1&&s_GPRS_CB.Socket_Info_t[count].LinkState==GPRSLinkState_Lost)
        {
            s_GPRS_CB.socketline_state=SocketState_Busy;
            s_GPRS_CB.cur_socket_info.Conncet_way=s_GPRS_CB.Socket_Info_t[count].Conncet_way;
            s_GPRS_CB.cur_socket_info.Domain=s_GPRS_CB.Socket_Info_t[count].Domain;
            s_GPRS_CB.cur_socket_info.IP_Address=s_GPRS_CB.Socket_Info_t[count].IP_Address;
            s_GPRS_CB.cur_socket_info.Server_port=s_GPRS_CB.Socket_Info_t[count].Server_port;
            s_GPRS_CB.cur_socket_info.Mux=s_GPRS_CB.Socket_Info_t[count].Mux;
            gprs_add_state(GPRSState_QIDNSIP_Req);
        }
        count++;
    }
}
static void gprs_check_process(void) //检测回复
{   
    switch (s_GPRS_CB.state)
    {   
        case GPRSState_AT_Resp:
        {   
            if (Gprs_ACK_Check("OK",PARTCHECK)==CHECKRIGHT)
            {
                s_GPRS_CB.retry_count = 0;
                s_GPRS_CB.state = GPRSState_Idle;
                gprs_add_state(GPRSState_IPR_Req);
                GprsTask_Send_Event(GPRS_TASK_LOOP_EVENT);
            }
            break;
        }
        case GPRSState_IPR_Resp:
        {
            if (Gprs_ACK_Check("OK",PARTCHECK)==CHECKRIGHT)
            {
                s_GPRS_CB.retry_count = 0;
                s_GPRS_CB.state = GPRSState_Idle;
                gprs_add_state(GPRSState_ATE_Req);
                GprsTask_Send_Event(GPRS_TASK_LOOP_EVENT);
            }
            break;
        }            
        case GPRSState_ATE_Resp:
        {
            if (Gprs_ACK_Check("OK",PARTCHECK)==CHECKRIGHT)
            {
                s_GPRS_CB.retry_count = 0;
                s_GPRS_CB.state = GPRSState_Idle;
                gprs_add_state(GPRSState_CPIN_Req);
                GprsTask_Send_Event(GPRS_TASK_LOOP_EVENT);
            }
            break;
        }
        case GPRSState_CPIN_Resp:
        {
            if (Gprs_ACK_Check("READY",PARTCHECK)==CHECKRIGHT)
            {
                s_GPRS_CB.retry_count = 0;
                s_GPRS_CB.state = GPRSState_Idle;
                //gprs_add_state(GPRSState_CSQ_Req);
                gprs_add_state(GPRSState_CREG_Req);
                GprsTask_Send_Event(GPRS_TASK_LOOP_EVENT);
            }
            break;
        }
        case GPRSState_CREG_Resp:
        {
            if (Gprs_ACK_Check("0,1",PARTCHECK)==CHECKRIGHT||
                Gprs_ACK_Check("0,5",PARTCHECK)==CHECKRIGHT)
            {
                s_GPRS_CB.retry_count = 0;
                s_GPRS_CB.state = GPRSState_Idle;
                gprs_add_state(GPRSState_CGREG_Req);
                GprsTask_Send_Event(GPRS_TASK_LOOP_EVENT);
            } 
            break;
        }
        case GPRSState_CSQ_Resp:
        {   
            uint8_t i;
            uint8_t *p;
          //  uint8_t csqbuf[20],buflen;
            if(Gprs_ACK_Check("OK",PARTCHECK)==CHECKRIGHT)
            {   
                p=g_AT_ReceiveBuf.Buf[g_AT_ReceiveBuf.Out].Buf;
                for(i=0;i<strlen((char const*)p);i++)
                {
                    if(p[0]!=':')
                    {
                        p++;
                    }
                    else 
                    {
                        break;
                    }
                }
                if(p[3]==0x2C)
                {
                    s_GPRS_CB.rssi=(p[2]-48);
                }
                else
                {
                    s_GPRS_CB.rssi=(p[2]-48)*10+(p[3]-48);
                }
                s_GPRS_CB.rssi_count--;
                s_GPRS_CB.extra_request=GPRS_None_Req; 
                s_GPRS_CB.state = GPRSState_Idle;
                ZSProto_Make_RssiResp(s_GPRS_CB.rssi);
                DEBUG("[GPRS] Rssi:%d\r\n",s_GPRS_CB.rssi);
                GprsTask_Send_Event(GPRS_TASK_LOOP_EVENT);
            }
          break;
        }
        case GPRSState_CGREG_Resp:
        {
            if (Gprs_ACK_Check("0,1",PARTCHECK)==CHECKRIGHT||
                Gprs_ACK_Check("0,5",PARTCHECK)==CHECKRIGHT)
            {
                s_GPRS_CB.retry_count = 0;
                s_GPRS_CB.state = GPRSState_Idle;
                gprs_add_state(GPRSState_CGATT_Req);
                GprsTask_Send_Event(GPRS_TASK_LOOP_EVENT);
            }
            break;
        }
        case GPRSState_CGATT_Resp:
        {
            if (Gprs_ACK_Check("1",PARTCHECK)==CHECKRIGHT)
            {
                s_GPRS_CB.retry_count = 0;
                s_GPRS_CB.state = GPRSState_Idle;
                gprs_add_state(GPRSState_QIMUX_Req);
                GprsTask_Send_Event(GPRS_TASK_LOOP_EVENT);
            }
            break;
        }
        case GPRSState_QIMUX_Resp:
        {   
            uint8_t check_result;
            check_result=Gprs_ACK_Check("OK",PARTCHECK);
            if (check_result==CHECKRIGHT)
            {
                s_GPRS_CB.retry_count = 0;
                s_GPRS_CB.state = GPRSState_Idle;
                s_GPRS_CB.socketline_state=SocketState_Idle;
                s_GPRS_CB.Gprs_Init_Status=Gprs_Init_Complete;
                INFO("[GPRS] GPRS Init OK\r\n");                
                GprsTask_Send_Event(GPRS_TASK_LOOP_EVENT);
            }
            else if(check_result==CHECKERROR)
            {
                s_GPRS_CB.retry_count = 0;
                s_GPRS_CB.state = GPRSState_Idle;
                gprs_add_state(GPRSState_QIMUXE_Req);
                GprsTask_Send_Event(GPRS_TASK_LOOP_EVENT);
            }
            break;
        } 
        case GPRSState_QIMUXE_Resp:
        {
            if (Gprs_ACK_Check("1",PARTCHECK)==CHECKRIGHT)
            {
                s_GPRS_CB.retry_count = 0;
                s_GPRS_CB.state = GPRSState_Idle;
                s_GPRS_CB.socketline_state=SocketState_Idle;
                s_GPRS_CB.Gprs_Init_Status=Gprs_Init_Complete;          
                GprsTask_Send_Event(GPRS_TASK_LOOP_EVENT);
            }
            break;
        }
        case GPRSState_QIDNSIP_Resp:
        {   
            if (Gprs_ACK_Check("OK",PARTCHECK)==CHECKRIGHT)
            {
                s_GPRS_CB.retry_count = 0;
                s_GPRS_CB.state = GPRSState_Idle;
                gprs_add_state(GPRSState_QIOPEN_Req);            
                GprsTask_Send_Event(GPRS_TASK_LOOP_EVENT);
            }
            break;
        }
        case GPRSState_QIOPEN_Resp:
        { 
            uint8_t check_result;
            check_result=Gprs_ACK_Check("CONNECT OK",PARTCHECK);            
            if (check_result==CHECKRIGHT)
            {   
                s_GPRS_CB.retry_count = 0;
                s_GPRS_CB.state = GPRSState_Idle;
                s_GPRS_CB.socketline_state=SocketState_Idle;
                s_GPRS_CB.Socket_Info_t[s_GPRS_CB.cur_socket_info.Mux].LinkState=GPRSLinkState_Establish;
                DEBUG("[GPRS] Socket:%d Connect OK\r\n",s_GPRS_CB.cur_socket_info.Mux);
                GprsTask_Send_Event(GPRS_TASK_LOOP_EVENT);
            }
            else 
            {
                GprsTask_Send_Event(GPRS_TASK_ACK_EVENT);
            }
            break;
        }
        case GPRSState_QICLOSE_Resp:
        {
            if (Gprs_ACK_Check("CLOSE OK",PARTCHECK)==CHECKRIGHT)
            {
                s_GPRS_CB.retry_count = 0;
                s_GPRS_CB.state = GPRSState_Idle;
                s_GPRS_CB.Socket_Info_t[s_GPRS_CB.cur_socket_info.Mux].LinkState=GPRSLinkState_Lost;
                DEBUG("[GPRS] Socket:%d Close OK\r\n",s_GPRS_CB.cur_socket_info.Mux);
                GprsTask_Send_Event(GPRS_TASK_LOOP_EVENT);
            }
            break;
        }
        case GPRSState_QISEND_Resp:
        {
            if (Gprs_ACK_Check(">",PARTCHECK)==CHECKRIGHT)
            {
                s_GPRS_CB.retry_count = 0;
                s_GPRS_CB.state = GPRSState_QISEND_Data_Req;      
                GprsTask_Send_Event(GPRS_TASK_LOOP_EVENT);
            }
            break;
        }
        case GPRSState_QISEND_Data_Resp:
        {
            if (Gprs_ACK_Check("SEND OK",PARTCHECK)==CHECKRIGHT)
            {
                s_GPRS_CB.retry_count = 0;
                s_GPRS_CB.state = GPRSState_Idle;
                s_GPRS_CB.extra_request=GPRS_None_Req;
                g_Machine_TransmitBuf.Out++;
                g_Machine_TransmitBuf.Out %= g_Machine_TransmitBuf.Size;
                g_Machine_TransmitBuf.Count--;  
                DEBUG("[GPRS] SEND OK\r\n");
            }
            break;
        }  
        case GPRSState_QISACK_Resp:
        {
            if (Gprs_ACK_Check("QISACK:",PARTCHECK)==CHECKRIGHT)
            {
                s_GPRS_CB.retry_count = 0;
                /*查找无ACK长度*/
                s_GPRS_CB.noack_len=getnoackLen();
                if(s_GPRS_CB.noack_len>GPRS_CMD_QISACK_NO_ACK_MAX)
                {
                  s_GPRS_CB.Socket_Info_t[s_GPRS_CB.CurQISACKSocketNumber].LinkState=GPRSLinkState_Lost;
                }
                s_GPRS_CB.state = GPRSState_Idle;
                s_GPRS_CB.extra_request=GPRS_None_Req;
                DEBUG("[GPRS] QISACK:%s Noack:%d\r\n",g_AT_ReceiveBuf.Buf[g_AT_ReceiveBuf.Out].Buf,s_GPRS_CB.noack_len);
                GprsTask_Send_Event(GPRS_TASK_LOOP_EVENT);
            }
            break;
        }
        default:
           break;
        }
}
static void gprs_idle_process(void) //空闲检测事件
{
    gprs_update_state();
    gprs_update_request();
    gprs_update_socket();
}
static void gprs_msg_queue_clear(void)  //清空消息队列
{   
   s_GPRSMsgQueue.In = 0;
   s_GPRSMsgQueue.Out = 0;
   s_GPRSMsgQueue.Count = 0;
}
static void gprs_socket_deinit(void)  //socket 复位
{
    uint8_t i;
    for(i=0;i<s_GPRS_CB.scoket_count;i++)
    {
        s_GPRS_CB.Socket_Info_t[i].LinkState=GPRSLinkState_Lost;
    }
    
