moiify/M26-DTU/stm32f030x8/projects/stm32f10x_std/Source/FML/gprs/gprs_process.c
}
static void gprs_attribute_deinit(void) // 模块状态复位
{ 
    s_GPRS_CB.rssi_count=0;
    s_GPRS_CB.qisack_req=0;
    s_GPRS_CB.Gprs_Init_Status=Gprs_Init_NotComplete; 
    s_GPRS_CB.socketline_state=SocketState_Busy;
}
static uint16_t getnoackLen()
{
    uint8_t *p;
    uint8_t i,j=0;
    uint16_t len=0;
    p=g_AT_ReceiveBuf.Buf[g_AT_ReceiveBuf.Out].Buf;
    for(i=0;i<strlen((const char*)g_AT_ReceiveBuf.Buf[g_AT_ReceiveBuf.Out].Buf);i++)
    {
        if(*p!=',')
        {
            p++;
        }
        else 
        {   
            j++;
            if(j!=2)
            {   
                p++;
            }
            else
            {   
                break;
            }
        }
    }
    p+=2;
    len=atoi((const char *)p);
    return len;
}
void GPRS_Loop_Process(void)  
{
    char send_buf[512];
    switch (s_GPRS_CB.state)
    {
        case GPRSState_PowerOff_Req:
        {
            gprs_msg_queue_clear();
            gprs_socket_deinit();
            gprs_attribute_deinit();
            s_GPRS_CB.state = GPRSState_PowerOff_Resp;
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            BSP_GPRS_PowerOff();
            INFO("[GPRS] Moudle start power off\r\n");
            break;
        }
        case GPRSState_PowerOff_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks >= GPRS_POWEROFF_HOLD_TIME)
            {
                s_GPRS_CB.state = GPRSState_PowerOn_Req;
            }
            break;
        }
        case GPRSState_PowerOn_Req:
        {   
            //gprs_socket_state_reset_all();
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_PowerOn_Resp;
            BSP_GPRS_PowerOn();
            INFO("[GPRS] Moudle start power on\r\n");
            break;
        }
        case GPRSState_PowerOn_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_POWERON_DELAY_TIME)
            {
                s_GPRS_CB.state = GPRSState_PowerKey_Req;
            }
            break;
        }
        case GPRSState_PowerKey_Req:
        {
            BSP_GPRS_PowerKeyLow();
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_PowerKey_Resp;
            INFO("[GPRS] Gprs start boot \r\n");
            break;
        }
        case GPRSState_PowerKey_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks >= GPRS_POWERKEY_HOLD_TIME)
            {   
                s_GPRS_CB.moudle_status=~s_GPRS_CB.moudle_status;
                BSP_GPRS_PowerKeyHigh();  //保持M26引脚持续高电平
                s_GPRS_CB.state = GPRSState_Idle;
                gprs_add_state(GPRSState_AT_Req);
            }
            break;
        }
        case GPRSState_AT_Req:
        {   
            GPRS_WriteBytes("AT\r\n",strlen("AT\r\n"));
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_AT_Resp;
            s_GPRS_CB.socketline_state=SocketState_Busy;
            s_GPRS_CB.extra_request=GPRS_None_Req;
            gprs_msg_queue_clear();
            gprs_socket_deinit(); 
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:AT,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;            
        }
        case GPRSState_AT_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks >= GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD AT timeout\r\n");
                if (s_GPRS_CB.retry_count >= 20)
                {
                    s_GPRS_CB.retry_count = 0;
                    s_GPRS_CB.state = GPRSState_PowerOff_Req;
                }
                else
                {
                    s_GPRS_CB.state = GPRSState_AT_Req;
                }
            }
            break;
        }
        case GPRSState_IPR_Req:
        {   
            sprintf(send_buf,"AT+IPR=%d\r\n",g_SystemInfo.Gprs_Boundrate);
            GPRS_WriteBytes((uint8_t *)send_buf,strlen(send_buf));
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_IPR_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:AT+IPR,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;            
        }
        case GPRSState_IPR_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks >= GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD IPR timeout\r\n");
                if (s_GPRS_CB.retry_count >= 20)
                {
                    s_GPRS_CB.retry_count = 0;
                    s_GPRS_CB.state = GPRSState_AT_Req;
                }
                else
                {
                    s_GPRS_CB.state = GPRSState_IPR_Req;
                }
            }
            break;
        }
        case GPRSState_ATE_Req:
        {
            GPRS_WriteBytes("ATE0\r\n",strlen("ATE0\r\n"));
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_ATE_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:ATE,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        }
        case GPRSState_ATE_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks >= GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD ATE timeout\r\n");
                if (s_GPRS_CB.retry_count >= GPRS_ATCMD_RETRYCOUNT_MAX)
                {
                    s_GPRS_CB.state = GPRSState_AT_Req;
                    s_GPRS_CB.retry_count=0;
                }
                else 
                {
                    s_GPRS_CB.state = GPRSState_ATE_Req;
                }
            }
            break;
        }
        case GPRSState_CPIN_Req:
        {
            GPRS_WriteBytes("AT+CPIN?\r\n",strlen("AT+CPIN?\r\n"));
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_CPIN_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:CPIN,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        }
        case GPRSState_CPIN_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks >= GPRS_CMD_CPIN_TIMEOUT_TIME)
            {
                DEBUG("[GPRS] CMD CPIN timeout\r\n");
                if (s_GPRS_CB.retry_count >= GPRS_ATCMD_RETRYCOUNT_MAX)
                {
                    s_GPRS_CB.state = GPRSState_AT_Req;
                    s_GPRS_CB.retry_count=0;
                }
                else 
                {
                    s_GPRS_CB.state = GPRSState_CPIN_Req;
                }
            }
            break;
        }
        case GPRSState_CSQ_Req:
        {
            GPRS_WriteBytes("AT+CSQ\r\n",strlen("AT+CSQ\r\n"));
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_CSQ_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:CSQ\r\n",s_GPRS_CB.retry_count);
            break;
        }
        case GPRSState_CSQ_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks >= GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD CSQ timeout\r\n");
                if (s_GPRS_CB.retry_count >= GPRS_ATCMD_CSQ_RETRYCOUNT_MAX)
                {
                    s_GPRS_CB.state = GPRSState_AT_Req;
                    s_GPRS_CB.retry_count=0;
                }
                else 
                {
                    s_GPRS_CB.state = GPRSState_CSQ_Req;
                }
            }
            break;
        }
        case GPRSState_CREG_Req:
        {
            GPRS_WriteBytes("AT+CREG?\r\n",strlen("AT+CREG?\r\n"));
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_CREG_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:CREG,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        }
        case GPRSState_CREG_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD CREG timeout\r\n");
                if (s_GPRS_CB.retry_count >= GPRS_ATCMD_CREG_RETRYCOUNT_MAX)
                {
                    s_GPRS_CB.state = GPRSState_AT_Req;
                    s_GPRS_CB.retry_count=0;
                }
                else 
                {
                    s_GPRS_CB.state = GPRSState_CREG_Req;
                }
            }
            break;
        }
        case GPRSState_CGREG_Req:
        {
            GPRS_WriteBytes("AT+CGREG?\r\n",strlen("AT+CGREG?\r\n"));
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_CGREG_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:CGREG,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        }
        case GPRSState_CGREG_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD CGREG timeout\r\n");
                if (s_GPRS_CB.retry_count >= GPRS_ATCMD_CGREG_RETRYCOUNT_MAX)
                {
                    s_GPRS_CB.state = GPRSState_AT_Req;
                    s_GPRS_CB.retry_count=0;
                }
                else 
                {
                    s_GPRS_CB.state = GPRSState_CGREG_Req;
                }
            }
            break;
        }
        case GPRSState_CGATT_Req:
        {
            GPRS_WriteBytes("AT+CGATT?\r\n",strlen("AT+CGATT?\r\n"));
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_CGATT_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:CREG,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        }        
        case GPRSState_CGATT_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD CREG timeout\r\n");
                if (s_GPRS_CB.retry_count >= GPRS_ATCMD_CREG_RETRYCOUNT_MAX)
                {
                    s_GPRS_CB.state = GPRSState_AT_Req;
                    s_GPRS_CB.retry_count=0;
                }
                else 
                {
                    s_GPRS_CB.state = GPRSState_CGATT_Req;
                }
            }
            break;
        }        
        case GPRSState_QIMUX_Req:
        {
            GPRS_WriteBytes("AT+QIMUX=1\r\n",strlen("AT+QIMUX=1\r\n"));
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_QIMUX_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:QIMUX,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        }
        case GPRSState_QIMUX_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD QIMUX timeout\r\n");
                if (s_GPRS_CB.retry_count >= GPRS_ATCMD_RETRYCOUNT_MAX)
                {
                    s_GPRS_CB.state = GPRSState_AT_Req;
                    s_GPRS_CB.retry_count=0;
                }
                else 
                {
                    s_GPRS_CB.state = GPRSState_QIMUX_Req;
                }
            }
            break;
        }
        case GPRSState_QIMUXE_Req:
        {   
            GPRS_WriteBytes("AT+QIMUX?\r\n",strlen("AT+QIMUX?\r\n"));
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_QIMUXE_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:QIMUXE,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        }
        case GPRSState_QIMUXE_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {            
                DEBUG("[GPRS] CMD QIMUXE timeout\r\n");
                if (s_GPRS_CB.retry_count >= GPRS_ATCMD_RETRYCOUNT_MAX)
                {
                    s_GPRS_CB.state = GPRSState_AT_Req;
                    s_GPRS_CB.retry_count=0;
                }
                else 
                {
                    s_GPRS_CB.state = GPRSState_QIMUXE_Req;
                }
            }
            break;
        }
        case GPRSState_QIDNSIP_Req:
        {   
            if(s_GPRS_CB.cur_socket_info.Conncet_way==IP_Connect)
            {
                GPRS_WriteBytes("AT+QIDNSIP=0\r\n",strlen("AT+QIDNSIP=0\r\n"));
            }
            else if(s_GPRS_CB.cur_socket_info.Conncet_way==Domain_Connect)
            {
                GPRS_WriteBytes("AT+QIDNSIP=1\r\n",strlen("AT+QIDNSIP=1\r\n"));
            }
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_QIDNSIP_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:QIDNSIP,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        }
        case GPRSState_QIDNSIP_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD QIDNSIP timeout\r\n");
                if (s_GPRS_CB.retry_count >= GPRS_ATCMD_RETRYCOUNT_MAX)
                {
                    s_GPRS_CB.state = GPRSState_AT_Req;
                    s_GPRS_CB.retry_count=0;
                }
                else 
                {
                    s_GPRS_CB.state = GPRSState_QIDNSIP_Req;
                }
            }
            break;
        }
        case GPRSState_QIOPEN_Req:
        {
            if(s_GPRS_CB.cur_socket_info.Conncet_way==IP_Connect)
            {
                 sprintf(send_buf,"AT+QIOPEN=%d,\"TCP\",\"%s\",\"%d\"\r\n",s_GPRS_CB.cur_socket_info.Mux,s_GPRS_CB.cur_socket_info.IP_Address,s_GPRS_CB.cur_socket_info.Server_port);
                 GPRS_WriteBytes((uint8_t *)send_buf,strlen(send_buf));
            }
            else if(s_GPRS_CB.cur_socket_info.Conncet_way==Domain_Connect)
            {
                 sprintf(send_buf,"AT+QIOPEN=%d,\"TCP\",\"%s\",\"%d\"\r\n",s_GPRS_CB.cur_socket_info.Mux,s_GPRS_CB.cur_socket_info.Domain,s_GPRS_CB.cur_socket_info.Server_port);
                 GPRS_WriteBytes((uint8_t *)send_buf,strlen(send_buf));
            }
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_QIOPEN_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:QIOPEN,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        }
        case GPRSState_QIOPEN_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_CMD_QIOPEN_TIMEOUT_TIME)
            {
                    s_GPRS_CB.cur_socket_open_failed_count++;
                    if(s_GPRS_CB.cur_socket_open_failed_count==3)
                    {   
                        s_GPRS_CB.cur_socket_open_failed_count=0;
                        s_GPRS_CB.socketline_state=SocketState_Idle;
                    }
                    
                    else
                    {
                        gprs_add_state(GPRSState_QICLOSE_Req);
                        gprs_add_state(GPRSState_QIDNSIP_Req);
                    }
                    s_GPRS_CB.retry_count=0;
                    s_GPRS_CB.state = GPRSState_Idle;
            }
            break;
        }
        case GPRSState_QICLOSE_Req:
        {   
            sprintf(send_buf,"AT+QICLOSE=%d\r\n",s_GPRS_CB.cur_socket_info.Mux);
            GPRS_WriteBytes((uint8_t *)send_buf,strlen(send_buf));
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_QICLOSE_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:QICLOSE,retry(%d)\r\n",s_GPRS_CB.retry_count);
            break;
        } 
        case GPRSState_QICLOSE_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD QICLOSE timeout\r\n");
                if (s_GPRS_CB.retry_count >= GPRS_ATCMD_RETRYCOUNT_MAX)
                {
                    s_GPRS_CB.state = GPRSState_Idle;
                    s_GPRS_CB.retry_count=0;
                }
                else 
                {
                    s_GPRS_CB.state = GPRSState_QICLOSE_Req;
                }
            }
            break;
        }
        case GPRSState_QISEND_Req:
        {
            sprintf(send_buf,"AT+QISEND=%d,%d\r\n",g_Machine_TransmitBuf.Buf[g_Machine_TransmitBuf.Out].Mux,g_Machine_TransmitBuf.Buf[g_Machine_TransmitBuf.Out].Len);
            GPRS_WriteBytes((uint8_t *)send_buf,strlen(send_buf));
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_QISEND_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:%s\r\n",send_buf);
            break;
        }
        case GPRSState_QISEND_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {   
                s_GPRS_CB.Socket_Info_t[g_Machine_TransmitBuf.Buf[g_Machine_TransmitBuf.Out].Mux].LinkState=GPRSLinkState_Lost;
                s_GPRS_CB.state = GPRSState_Idle;
                s_GPRS_CB.extra_request=GPRS_None_Req;
                s_GPRS_CB.retry_count=0;
            }
            break;
        }
        case GPRSState_QISEND_Data_Req:
        {
            //sprintf(send_buf,"%s",g_Machine_TransmitBuf.Buf[g_Machine_TransmitBuf.Out].Buf);//
            memcpy(send_buf,g_Machine_TransmitBuf.Buf[g_Machine_TransmitBuf.Out].Buf,g_Machine_TransmitBuf.Buf[g_Machine_TransmitBuf.Out].Len+1);
            s_GPRS_CB.state = GPRSState_QISEND_Data_Resp;
            GPRS_WriteBytes((uint8_t *)send_buf,g_Machine_TransmitBuf.Buf[g_Machine_TransmitBuf.Out].Len);
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:%s\r\n",send_buf);
            break;
        }
        case GPRSState_QISEND_Data_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > 10000)
            {
                DEBUG("[GPRS] CMD SendData timeout\r\n");
                s_GPRS_CB.Socket_Info_t[g_Machine_TransmitBuf.Buf[g_Machine_TransmitBuf.Out].Mux].LinkState=GPRSLinkState_Lost;
                s_GPRS_CB.state = GPRSState_Idle;
                s_GPRS_CB.extra_request=GPRS_None_Req;
                s_GPRS_CB.retry_count=0;
            }
            break;
        }        

