moiify/M26-DTU/stm32f030x8/projects/stm32f10x_std/Source/FML/gprs/gprs_process.c
        case GPRSState_QISACK_Req:
        {   
            s_GPRS_CB.qisack_req=0;
            sprintf((char *)send_buf, "AT+QISACK=%d\r\n", s_GPRS_CB.CurQISACKSocketNumber);
            GPRS_WriteBytes((uint8_t *)send_buf,strlen(send_buf));
            s_GPRS_CB.ticks = OS_Clock_GetSystemClock();
            s_GPRS_CB.state = GPRSState_QISACK_Resp;
            s_GPRS_CB.retry_count++;
            DEBUG("[GPRS] CMD:QISACK(%d)\r\n", s_GPRS_CB.CurQISACKSocketNumber);
            break;
        }
        case GPRSState_QISACK_Resp:
        {
            if (OS_Clock_GetSystemClock() - s_GPRS_CB.ticks > GPRS_TIMEOUT_TICKS)
            {
                DEBUG("[GPRS] CMD QISACK timeout\r\n");
                s_GPRS_CB.state = GPRSState_Idle;
                s_GPRS_CB.retry_count=0;
                s_GPRS_CB.extra_request=GPRS_None_Req;
            }
            break;
        }
        case GPRSState_Idle:
        {
            gprs_idle_process();
            break;
        }
        default:
        {
            break;
        }
    }
}
void GPRS_ACK_Process(void)
{   
    uint8_t muxnum;
    if(g_AT_ReceiveBuf.Count>0)
    {   
        
        gprs_check_process();
        if( strstr((char *)g_AT_ReceiveBuf.Buf[g_AT_ReceiveBuf.Out].Buf,"CLOSED")!=NULL&&strstr((char *)g_AT_ReceiveBuf.Buf[g_AT_ReceiveBuf.Out].Buf,"OK")==NULL)
        {   
            muxnum=g_AT_ReceiveBuf.Buf[g_AT_ReceiveBuf.Out].Buf[2]-48;
            s_GPRS_CB.Socket_Info_t[muxnum].LinkState=GPRSLinkState_Lost;
            DEBUG("[GPRS] Socket:%d Closed\r\n",muxnum);
        }
        if( strstr((char *)g_AT_ReceiveBuf.Buf[g_AT_ReceiveBuf.Out].Buf,"RECEIVE")!=NULL)
        {   
            if(Server_receiveDataInfo.Count<Server_receiveDataInfo.Size)
            {
                Gprs_GetSocketAndLength();
                DEBUG("[GPRS] +RECEIVE:%s \r\n",Server_receiveDataInfo.buf[Server_receiveDataInfo.In].Buf);
                Server_receiveDataInfo.In++;
                Server_receiveDataInfo.Count++;
                Server_receiveDataInfo.In %=Server_receiveDataInfo.Size;
                UserTask_Send_Event(USER_TASK_LOOP_EVENT);
            }
        }
        g_AT_ReceiveBuf.Count--;
        g_AT_ReceiveBuf.Out++;
        g_AT_ReceiveBuf.Out %=g_AT_ReceiveBuf.Size;
        
    }
}
void Gprs_Add_Sockets(Socket_Info_t scoket)  //添加Sokcet的接口
{  
    s_GPRS_CB.Socket_Info_t[s_GPRS_CB.scoket_count].Socket_En=scoket.ServerEN;
    s_GPRS_CB.Socket_Info_t[s_GPRS_CB.scoket_count].Conncet_way=scoket.ServerConnectway;
    if(s_GPRS_CB.Socket_Info_t[s_GPRS_CB.scoket_count].Conncet_way==0)
    {
        sprintf((char *)s_GPRS_CB.Socket_Info_t[s_GPRS_CB.scoket_count].IP_Address,(const char *)scoket.ServerIp);
    }
    else 
    {
        sprintf((char *)s_GPRS_CB.Socket_Info_t[s_GPRS_CB.scoket_count].Domain,(const char *)scoket.ServerDomain);
    }
    s_GPRS_CB.Socket_Info_t[s_GPRS_CB.scoket_count].Server_port=scoket.ServerPort;
    s_GPRS_CB.Socket_Info_t[s_GPRS_CB.scoket_count].Mux=s_GPRS_CB.scoket_count;
    s_GPRS_CB.scoket_count++;
}
void Gprs_UpdateRssi()   //更新信号强度
{   
    if(g_SystemInfo.Gprs_Operatingmode==Gprs_Packagemode&&g_SystemInfo.Gprs_HeartbeatEN==1)
    {
        if(s_GPRS_CB.Gprs_Init_Status==Gprs_Init_Complete)
        {
            s_GPRS_CB.rssi_count++;
        }
    }
}
void Gprs_Cmd_QIACK()    //查询未发送数据量
{   
    static uint8_t i=0;
    for(;i<s_GPRS_CB.scoket_count;i++)
    {
        if(s_GPRS_CB.Socket_Info_t[i].LinkState==GPRSLinkState_Establish)
        {   
            s_GPRS_CB.CurQISACKSocketNumber=i++;
            s_GPRS_CB.qisack_req=1;
            break;
        }
    }
    if(i==s_GPRS_CB.scoket_count)
    {
        i=0;
    }
}
void Gprs_Reset_Moudle() //重启模块
{
   s_GPRS_CB.state= GPRSState_PowerOff_Req;
   s_GPRS_CB.scoket_count=0;
}